N-RECORD.
    05  TXN-ID    '     PIC 9(6).
   05  CCT-ID    REDEFINES TXN-ID PIC 5X    ME 
    05  AT-ID          REDEFINES TXN-ID PIC X).
    05  ANA05  REDEFINES TXN-ID PIC 4X(6ÿ‰
655175ALICE 