 PIC Q9)V98 COMP-3.
    07  R  PIC 9(0(9)V99 COMP-3.
 05 I-1  PIC 9Q((9)V99 COMP-3.7)9 COMP-3.
 05  HI-1  PIC Q9)V98 COMP-3.
    07  R  PIC 4(0(9)V99 COMP-3.
 05 I-1  PIC 9Q((9)V99 COMP-3.7))V99 COMP-3.
 05  HI-1  PIC Q9)V98 COMP-3.
    07  R  P]CP-3.
 05  HI-1  PIC Q9)V98 COMP-3.
    07  R  P]C 9(0(9)V99 COMP- I-1  PIC 9Q((9)V99 COMP-3.7)