    
05  TX PIC 9(6© PIC S8(9(9)V99 COMP-5.
    07   HI6).*   PIC S8(9(9)V99 COMP-5.
    07     PIC C)ÖO    PIC 9(9(9)V99 COMP-5.
      05 HI6!.*E   PIC 28(9(9)V99 COMP-5.
05 HI6!.*E   PIC S8977  RA